__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 773)          0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            (None, 773)          0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 600)          464400      input_1[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 600)          464400      input_2[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 400)          240400      dense_1[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 400)          240400      dense_5[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 200)          80200       dense_2[0][0]                    
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 200)          80200       dense_6[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 100)          20100       dense_3[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 100)          20100       dense_7[0][0]                    
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 200)          0           dense_4[0][0]                    
                                                                 dense_8[0][0]                    
__________________________________________________________________________________________________
dense_33 (Dense)                (None, 400)          80400       concatenate_7[0][0]              
__________________________________________________________________________________________________
dense_34 (Dense)                (None, 200)          80200       dense_33[0][0]                   
__________________________________________________________________________________________________
dense_35 (Dense)                (None, 100)          20100       dense_34[0][0]                   
__________________________________________________________________________________________________
dense_36 (Dense)                (None, 2)            202         dense_35[0][0]                   
==================================================================================================
Total params: 1,791,102
Trainable params: 1,791,102
Non-trainable params: 0
__________________________________________________________________________________________________
